<?php
require("../../inc/header.php");

/*
		SoftName : EmpireBak Version 2010
		Author   : wm_chief
		Copyright: Powered by www.phome.net
*/

DoSetDbChar('utf8');
E_D("DROP TABLE IF EXISTS `ecs_order_info`;");
E_C("CREATE TABLE `ecs_order_info` (
  `order_id` mediumint(8) unsigned NOT NULL AUTO_INCREMENT,
  `order_sn` varchar(20) NOT NULL DEFAULT '',
  `user_id` mediumint(8) unsigned NOT NULL DEFAULT '0',
  `order_status` tinyint(1) unsigned NOT NULL DEFAULT '0',
  `shipping_status` tinyint(1) unsigned NOT NULL DEFAULT '0',
  `pay_status` tinyint(1) unsigned NOT NULL DEFAULT '0',
  `consignee` varchar(60) NOT NULL DEFAULT '',
  `country` smallint(5) unsigned NOT NULL DEFAULT '0',
  `province` smallint(5) unsigned NOT NULL DEFAULT '0',
  `city` smallint(5) unsigned NOT NULL DEFAULT '0',
  `district` smallint(5) unsigned NOT NULL DEFAULT '0',
  `address` varchar(255) NOT NULL DEFAULT '',
  `zipcode` varchar(60) NOT NULL DEFAULT '',
  `tel` varchar(60) NOT NULL DEFAULT '',
  `mobile` varchar(60) NOT NULL DEFAULT '',
  `email` varchar(60) NOT NULL DEFAULT '',
  `best_time` varchar(120) NOT NULL DEFAULT '',
  `sign_building` varchar(120) NOT NULL DEFAULT '',
  `postscript` varchar(255) NOT NULL DEFAULT '',
  `shipping_id` tinyint(3) NOT NULL DEFAULT '0',
  `shipping_name` varchar(120) NOT NULL DEFAULT '',
  `pay_id` tinyint(3) NOT NULL DEFAULT '0',
  `pay_name` varchar(120) NOT NULL DEFAULT '',
  `how_oos` varchar(120) NOT NULL DEFAULT '',
  `how_surplus` varchar(120) NOT NULL DEFAULT '',
  `pack_name` varchar(120) NOT NULL DEFAULT '',
  `card_name` varchar(120) NOT NULL DEFAULT '',
  `card_message` varchar(255) NOT NULL DEFAULT '',
  `inv_payee` varchar(120) NOT NULL DEFAULT '',
  `inv_content` varchar(120) NOT NULL DEFAULT '',
  `goods_amount` decimal(10,2) NOT NULL DEFAULT '0.00',
  `shipping_fee` decimal(10,2) NOT NULL DEFAULT '0.00',
  `insure_fee` decimal(10,2) NOT NULL DEFAULT '0.00',
  `pay_fee` decimal(10,2) NOT NULL DEFAULT '0.00',
  `pack_fee` decimal(10,2) NOT NULL DEFAULT '0.00',
  `card_fee` decimal(10,2) NOT NULL DEFAULT '0.00',
  `money_paid` decimal(10,2) NOT NULL DEFAULT '0.00',
  `surplus` decimal(10,2) NOT NULL DEFAULT '0.00',
  `integral` int(10) unsigned NOT NULL DEFAULT '0',
  `integral_money` decimal(10,2) NOT NULL DEFAULT '0.00',
  `bonus` decimal(10,2) NOT NULL DEFAULT '0.00',
  `order_amount` decimal(10,2) NOT NULL DEFAULT '0.00',
  `from_ad` smallint(5) NOT NULL DEFAULT '0',
  `referer` varchar(255) NOT NULL DEFAULT '',
  `add_time` int(10) unsigned NOT NULL DEFAULT '0',
  `confirm_time` int(10) unsigned NOT NULL DEFAULT '0',
  `pay_time` int(10) unsigned NOT NULL DEFAULT '0',
  `shipping_time` int(10) unsigned NOT NULL DEFAULT '0',
  `pack_id` tinyint(3) unsigned NOT NULL DEFAULT '0',
  `card_id` tinyint(3) unsigned NOT NULL DEFAULT '0',
  `bonus_id` mediumint(8) unsigned NOT NULL DEFAULT '0',
  `invoice_no` varchar(255) NOT NULL DEFAULT '',
  `extension_code` varchar(30) NOT NULL DEFAULT '',
  `extension_id` mediumint(8) unsigned NOT NULL DEFAULT '0',
  `to_buyer` varchar(255) NOT NULL DEFAULT '',
  `pay_note` varchar(255) NOT NULL DEFAULT '',
  `agency_id` smallint(5) unsigned NOT NULL,
  `inv_type` varchar(60) NOT NULL,
  `tax` decimal(10,2) NOT NULL,
  `is_separate` tinyint(1) NOT NULL DEFAULT '0',
  `parent_id` mediumint(8) unsigned NOT NULL DEFAULT '0',
  `discount` decimal(10,2) NOT NULL,
  PRIMARY KEY (`order_id`),
  UNIQUE KEY `order_sn` (`order_sn`),
  KEY `user_id` (`user_id`),
  KEY `order_status` (`order_status`),
  KEY `shipping_status` (`shipping_status`),
  KEY `pay_status` (`pay_status`),
  KEY `shipping_id` (`shipping_id`),
  KEY `pay_id` (`pay_id`),
  KEY `extension_code` (`extension_code`,`extension_id`),
  KEY `agency_id` (`agency_id`)
) ENGINE=MyISAM AUTO_INCREMENT=30 DEFAULT CHARSET=utf8");
E_D("replace into `ecs_order_info` values('1','2013121684882','0','5','1','2','111','1','4','55','541','111','111','111','11','222@qq.com','','','','5','申通快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','399.00','15.00','0.00','0.00','0.00','0.00','414.00','0.00','0','0.00','0.00','0.00','0','本站','1387156881','1387156893','1387156893','1387156904','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('2','2013121628773','0','5','1','2','111','1','7','101','902','333','444','5655','','222@qq.com','','','','5','申通快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','1995.00','15.00','0.00','0.00','0.00','0.00','2010.00','0.00','0','0.00','0.00','0.00','0','本站','1387157023','1387157036','1387157036','1387157046','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('3','2014010686810','0','0','0','0','111111','1','4','55','539','111111111','111111','15000679021','','111111@qq.com','','','','5','申通快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','1179.00','15.00','0.00','0.00','0.00','0.00','0.00','0.00','0','0.00','0.00','1194.00','0','本站','1388955903','0','0','0','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('4','2014012127768','8','5','1','2','dagaf','1','3','37','410','hgahahahahr','','12345678993','','123@qq.com','','','','5','申通快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','439.00','15.00','0.00','0.00','0.00','0.00','454.00','0.00','0','0.00','0.00','0.00','0','本站','1390267776','1390267814','1390267814','1390267904','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('5','2014012262262','0','0','0','0','fshshs','1','5','64','618','dagdsagarhga','235462','12354689522','','123@qq.com','','','','5','申通快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','878.00','15.00','0.00','0.00','0.00','0.00','0.00','0.00','0','0.00','0.00','893.00','0','本站','1390341748','0','0','0','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('6','2014012383197','0','5','1','2','111111','1','5','65','626','agagqarygsae','235645','12345678944','','123456@qq.com','','','','5','申通快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','259.00','15.00','0.00','0.00','0.00','0.00','274.00','0.00','0','0.00','0.00','0.00','0','本站','1390413144','1390413159','1390413165','1390413197','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('7','2014012386380','8','5','1','2','dagaf','1','3','37','410','hgahahahahr','','12345678993','','123@qq.com','','','','5','申通快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','259.00','15.00','0.00','0.00','0.00','0.00','274.00','0.00','0','0.00','0.00','0.00','0','本站','1390413515','1390413526','1390413531','1390413545','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('8','2014012362771','8','5','1','2','dagaf','1','3','37','410','hgahahahahr','','12345678993','','123@qq.com','','','','5','申通快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','1118.00','15.00','0.00','0.00','0.00','0.00','1133.00','0.00','0','0.00','0.00','0.00','0','本站','1390413591','1390413603','1390413608','1390413621','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('9','2014012338692','8','5','1','2','dagaf','1','3','37','410','hgahahahahr','','12345678993','','123@qq.com','','','','5','申通快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','2037.00','15.00','0.00','0.00','0.00','0.00','2052.00','0.00','0','0.00','0.00','0.00','0','本站','1390413714','1390413724','1390413730','1390413742','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('10','2014012367996','8','5','1','2','dagaf','1','3','37','410','hgahahahahr','','12345678993','','123@qq.com','','','','5','申通快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','2007.00','15.00','0.00','0.00','0.00','0.00','2022.00','0.00','0','0.00','0.00','0.00','0','本站','1390413797','1390413805','1390413810','1390413820','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('11','2014012300489','8','0','0','0','dagaf','1','3','37','410','hgahahahahr','','12345678993','','123@qq.com','','','','5','申通快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','518.00','15.00','0.00','0.00','0.00','0.00','0.00','0.00','0','0.00','0.00','533.00','0','本站','1390415987','0','0','0','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('12','2014012354050','8','0','0','0','dagaf','1','3','37','410','hgahahahahr','','12345678993','','123@qq.com','','','','5','申通快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','399.00','15.00','0.00','0.00','0.00','0.00','0.00','0.00','0','0.00','0.00','414.00','0','本站','1390416008','0','0','0','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('13','2014012311339','8','0','0','0','dagaf','1','3','37','410','hgahahahahr','','12345678993','','123@qq.com','','','','5','申通快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','45.00','15.00','0.00','0.00','0.00','0.00','0.00','0.00','0','0.00','0.00','60.00','0','本站','1390416045','0','0','0','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('14','2014012385138','8','0','0','0','dagaf','1','3','37','410','hgahahahahr','','12345678993','','123@qq.com','','','','5','申通快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','99.00','15.00','0.00','0.00','0.00','0.00','0.00','0.00','0','0.00','0.00','114.00','0','本站','1390416071','0','0','0','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('15','2014012377587','8','0','0','0','dagaf','1','3','37','410','hgahahahahr','','12345678993','','123@qq.com','','','','5','申通快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','45.00','15.00','0.00','0.00','0.00','0.00','0.00','0.00','0','0.00','0.00','60.00','0','本站','1390416648','0','0','0','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('16','2014012311449','8','0','0','0','dagaf','1','3','37','410','hgahahahahr','','12345678993','','123@qq.com','','','','5','申通快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','320.00','15.00','0.00','0.00','0.00','0.00','0.00','0.00','0','0.00','0.00','335.00','0','本站','1390416675','0','0','0','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('17','2014012333005','8','0','0','0','dagaf','1','3','37','410','hgahahahahr','','12345678993','','123@qq.com','','','','5','申通快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','669.00','15.00','0.00','0.00','0.00','0.00','0.00','0.00','0','0.00','0.00','684.00','0','本站','1390416704','0','0','0','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('18','2014012301466','8','0','0','0','dagaf','1','3','37','410','hgahahahahr','','12345678993','','123@qq.com','','','','5','申通快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','49.90','15.00','0.00','0.00','0.00','0.00','0.00','0.00','0','0.00','0.00','64.90','0','本站','1390416978','0','0','0','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('19','2014012370841','8','0','0','0','dagaf','1','3','37','410','hgahahahahr','','12345678993','','123@qq.com','','','','5','申通快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','25.00','15.00','0.00','0.00','0.00','0.00','0.00','0.00','0','0.00','0.00','40.00','0','本站','1390417017','0','0','0','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('20','2014012345144','8','0','0','0','dagaf','1','3','37','410','hgahahahahr','','12345678993','','123@qq.com','','','','5','申通快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','229.00','15.00','0.00','0.00','0.00','0.00','0.00','0.00','0','0.00','0.00','244.00','0','本站','1390417059','0','0','0','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('21','2014012349039','8','0','0','0','dagaf','1','3','37','410','hgahahahahr','','12345678993','','123@qq.com','','','','5','申通快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','339.00','15.00','0.00','0.00','0.00','0.00','0.00','0.00','0','0.00','0.00','354.00','0','本站','1390417080','0','0','0','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('22','2014012342687','0','0','0','0','aetaega','1','6','78','713','adshaga','256988','12365898744','','125@qq.com','','','','5','申通快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','69.00','15.00','0.00','0.00','0.00','0.00','0.00','0.00','0','0.00','0.00','84.00','0','本站','1390417496','0','0','0','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('23','2014012389175','0','0','0','0','sdgadega','1','4','55','539','asdgagdag','123456','12345678963','','123456@qq.com','','','','5','申通快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','669.00','15.00','0.00','0.00','0.00','0.00','0.00','0.00','0','0.00','0.00','684.00','0','','1390417659','0','0','0','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('24','2014012351658','0','0','0','0','ertur6ue','1','5','62','605','srthsfsjdm','234200','15896587421','','1225@qq.com','','','','5','申通快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','275.00','15.00','0.00','0.00','0.00','0.00','0.00','0.00','0','0.00','0.00','290.00','0','','1390418109','0','0','0','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('25','2014012383507','0','0','0','0','sdhshsdj','1','4','56','548','sdhsdfhrs','234566','15896542131','','123@qq.com','','','','5','申通快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','320.00','15.00','0.00','0.00','0.00','0.00','0.00','0.00','0','0.00','0.00','335.00','0','','1390418164','0','0','0','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('26','2014012314897','0','0','0','0','sdhsrhdrhs','1','4','54','532','dhasrdgrahah','123456','154896222333','','123252@qq.com','','','','5','申通快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','459.00','15.00','0.00','0.00','0.00','0.00','0.00','0.00','0','0.00','0.00','474.00','0','本站','1390420686','0','0','0','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('27','2014041752615','11','0','0','0','adf adf','1','2','52','500','dsafadhhhhhhhhhhhhh','11111241241','124124241245','','adkjfadf@163.com','','','','5','申通快递','4','支付宝','等待所有商品备齐后再发','','精品包装','祝福贺卡','','','','988.90','15.00','0.00','0.00','0.00','5.00','0.00','0.00','0','0.00','0.00','1008.90','30','本站','1397669265','0','0','0','1','1','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('28','2015011975165','0','0','0','0','离骚','1','4','56','552','解放路23','','13256835666','','','','','','5','申通快递','4','支付宝','等待所有商品备齐后再发','','','','','','','65.00','15.00','0.00','0.00','0.00','0.00','0.00','0.00','0','0.00','0.00','80.00','0','本站','1421578592','0','0','0','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('29','2015011971367','23','0','0','0','Xzj','1','22','292','2408','110','','15554119699','','','','','','5','申通快递','4','支付宝','等待所有商品备齐后再发','','','','','','','50.00','15.00','0.00','0.00','0.00','0.00','0.00','0.00','0','0.00','0.00','50.00','0','本站','1421598465','0','0','0','0','0','0','','group_buy','17','','','0','','0.00','0','0','0.00');");

require("../../inc/footer.php");
?>